CD2DMesh.m_pMesh
A pointer to an ID2D1Mesh.

CD2DMesh.IsValid
Checks resource validity
Returns:
TRUE if resource is valid; otherwise FALSE.

CD2DMesh.Destroy
Destroys a CD2DMesh object.

CD2DMesh.Create(CRenderTarget*)
Creates a CD2DMesh.
Returns:
If the method succeeds, it returns S_OK. Otherwise, it returns an HRESULT error code.
pRenderTarget: A pointer to the render target.

CD2DMesh.Open
Opens the mesh for population.
Returns:
A pointer to an ID2D1TessellationSink that is used to populate the mesh.

CD2DMesh.op_Implicit~ID2D1Mesh*
Returns ID2D1Mesh interface
Returns:
Pointer to an ID2D1Mesh interface or NULL if object is not initialized yet.

CD2DMesh.Get
Returns ID2D1Mesh interface
Returns:
Pointer to an ID2D1Mesh interface or NULL if object is not initialized yet.

CD2DMesh.Detach
Detaches resource interface from the object
Returns:
Pointer to detached resource interface.

CD2DMesh.Attach(ID2D1Mesh*)
Attaches existing resource interface to the object
pResource: Existing resource interface. Cannot be NULL

CD2DMesh.Dispose
The destructor. Called when a D2D mesh object is being destroyed.

CD2DMesh.#ctor(CRenderTarget*,System.Int32)
Constructs a CD2DMesh object.
pParentTarget: A pointer to the render target.
bAutoDestroy: Indicates that the object will be destroyed by owner (pParentTarget).

CD2DMesh
ID2D1Mesh wrapper.